## Topic: Statistical Function in Pandas

### OUTCOMES

df['column'].sum()
df[['col1', 'col2']].sum(axis = 1)
df['column'].min()

df['column'].max()
df['column'].mean()
df['column'].mode()
df['column'].std()


df[['col1', 'col2']].corr()

df['new_col'] = df.iloc[::,2:5],sum(axis = 1)

### OUTCOMES

- 1. Basic Statistical Functions
    - .sum()
    - .min()
    - .max()
    - .mean()
    - .mode()
    - .std()


- 2. Correlatoin Between Columns
    - df[['col1', 'col2']].corr()

    - Using iloc for Column Range and Row Operations
        - df['new_col'] = df.iloc[row_idx,col_idx],sum(axis = 1)

- 3. Aggregate Multiple Statistics at Once

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("student_data.csv")

df.head()

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram

### 1. Basic Statistical Functions

- Syntax:
    - df[['col1', 'col2']].sum(axis = 1)

    - axis = 1 => column wise 
    - axis = 0 => row wise (By default)

In [15]:
# fill NaN value with zero
df.fillna(0)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,0.0,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,0.0,0.0,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi
6,PH1007,Mahmudul Hasan,80.0,80.0,0.0,In Progress,2024-04-01,Mr. Karim,Dhaka
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet
10,PH1011,Rahim Sheikh,0.0,0.0,91.0,In Progress,2024-06-11,Mr. Karim,Khulna
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram
12,PH1013,Tanvir Ahmed,75.0,75.0,79.0,Completed,2024-07-02,Mr. David,Dhaka
13,PH1014,Urmi Akter,0.0,0.0,0.0,Not Started,2024-07-09,Ms. Salma,Rajshahi
14,PH1015,Wahiduzzaman,86.0,86.0,84.0,Completed,2024-08-18,Mr. Karim,Dhaka
15,PH1016,Ziaur Rahman,94.0,94.0,0.0,In Progress,2024-08-21,Ms. Salma,Chattogram
16,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Mr. Karim,Dhaka
17,PH1018,Babul Ahmed,88.0,88.0,85.0,Completed,2025-09-05,Ms. Salma,Sylhet
18,PH1019,Faria Rahman,0.0,0.0,0.0,Not Started,2025-09-15,Mr. David,Chattogram
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka

In [16]:
# Sum of Python Marks 

df['Python Marks'].sum()	

# sum of Python Marks column

np.float64(1285.0)

In [17]:
# min value in Python Marks 

df['Python Marks'].min()

76.0

In [18]:
# max value in Python Marks

df['Python Marks'].max()

95.0

In [19]:
# mean value in Python Marks
df['Python Marks'].mean()

np.float64(85.66666666666667)

In [20]:
# median value in Python Marks

df['Python Marks'].median()

85.0

In [21]:
# std value in Python Marks

df['Python Marks'].std()

5.394000194219323

- Descriptive Statistics Summary

In [22]:
df.describe()

       Data Structure Marks  Algorithm Marks  Python Marks
count             16.000000        16.000000     15.000000
mean              84.000000        84.000000     85.666667
std                6.501282         6.501282      5.394000
min               72.000000        72.000000     76.000000
25%               79.500000        79.500000     83.000000
50%               85.500000        85.500000     85.000000
75%               88.250000        88.250000     88.500000
max               94.000000        94.000000     95.000000

### Sum accross Multiple columns

In [ ]:
# Multiple Columns sum() of total

df[['Data Structure Marks', 'Algorithm Marks', 'Python Marks']].sum()

# in total(row-wise)

Data Structure Marks    1344.0
Algorithm Marks         1344.0
Python Marks            1285.0
dtype: float64

In [29]:
# Multiple Column sum() in column-wise

df[['Data Structure Marks','Algorithm Marks','Python Marks']].sum(axis=1)

0     258.0
1     184.0
2     261.0
3     238.0
4      95.0
5     228.0
6     160.0
7     247.0
8     220.0
9     266.0
10     91.0
11    257.0
12    229.0
13      0.0
14    256.0
15    188.0
16    273.0
17    261.0
18      0.0
19    261.0
dtype: float64

### 2. Correlatoin Between Columns

- Describes the linear relationship between two quantitative variables (numerical Columns).

- Positive correlation:
    - one variable increases, then other variabel also increase.


- Negative correlation:
    - one variable increases, then other variable is decrease.


- Syntax of Correlation:
    - df[['col1', 'col2']].corr()

In [25]:
df.head(3)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka

In [ ]:
# Example of correlation of Data Structure Marks and Python Marks	

df[['Data Structure Marks','Python Marks']].corr()

# Positive Correlation

                      Data Structure Marks  Python Marks
Data Structure Marks              1.000000      0.893455
Python Marks                      0.893455      1.000000

In [ ]:
# Example of correlation of Algorithm Marks	 and Python Marks	
df[['Algorithm Marks','Python Marks']].corr()

# positive correlation

                 Algorithm Marks  Python Marks
Algorithm Marks         1.000000      0.893455
Python Marks            0.893455      1.000000

In [ ]:
# Error case when try to find correlation between non-numerical and numerical column

df[['StudentID','Python Marks']].corr()

## NOTE:
# Correlation must be numerical column

ValueError: could not convert string to float: 'PH1001'

#### Using iloc for Column Range and Row Operations

- Syntax:
    - df['new_col'] = df.iloc[row_idx, col_idx],sum(axis = 1)

    - new_col => add new column in df
    - row_idx star, row_idx_end

    - col_idx start, coln_idx end

In [33]:
df.head(2)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

In [ ]:
df['Total Marks'] = df.iloc[::, 2:5].sum(axis =1)
df.head(3)

# :: -> all rows
# 2 -> start coln idx
# 5 -> end coln idx (not include)
# axis = 1 -> column-wise sum

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,Total Marks
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,258.0
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,184.0
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka,261.0

### 3. Aggregate Multiple Statistics at Once

In [36]:
df[["Data Structure Marks", "Algorithm Marks", "Python Marks"]].agg(["sum", "mean", "min", "max", "std"])

      Data Structure Marks  Algorithm Marks  Python Marks
sum            1344.000000      1344.000000   1285.000000
mean             84.000000        84.000000     85.666667
min              72.000000        72.000000     76.000000
max              94.000000        94.000000     95.000000
std               6.501282         6.501282      5.394000